Autodesk.Revit.DB.Structure.ReinforcementRoundingManager.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Structure.ReinforcementRoundingManager.LengthDisplayUnit
The length units used when displaying the reinforcement rounding values.
Since:
2014

Autodesk.Revit.DB.Structure.ReinforcementRoundingManager.IsActiveOnElement
Defines whether reinforcement rounding is activated for the particular element.
Remarks:
If these overrides relate to ReinforcementSettings, this property is shared for Rebar and Fabric related elements. Toggling this value will toggle the settings for both kinds of Reinforcement elements.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: Reinforcement rounding overrides for this element cannot be enabled because overrides are not enabled for ReinforcementSettings.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Since:
2014

Autodesk.Revit.DB.Structure.ReinforcementRoundingManager.Element
The owner of the reinforcement rounding overrides.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2014

Autodesk.Revit.DB.Structure.ReinforcementRoundingManager
A base class providing access to reinforcement rounding overrides for structural elements.
Remarks:
Subclasses of this class are used to access the override settings for Rebar elements and types or Fabric elements and types.
Since:
2014